### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [39]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [40]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [41]:
purchase_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [42]:
purchase_data.SN.nunique()

576

In [43]:
total_players = purchase_data.SN.nunique()

player_summ = pd.DataFrame()
player_summ["Total Players"] = [total_players]
player_summ

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [44]:
items = purchase_data["Item ID"].nunique()
avg_price = purchase_data["Price"].mean()
purchase_count = purchase_data["Purchase ID"].count()
revenue = purchase_data["Price"].sum()


summ_table2 = pd.DataFrame()
summ_table2["Number of Unique Items"] = [items]
summ_table2["Average Price"] = [avg_price]
summ_table2["Number of Purchases"] = [purchase_count]
summ_table2["Total Revenue"] = [revenue]

summ3 = summ_table2.copy()

In [45]:

summ3["Average Price"] = summ3["Average Price"].map("${:.2f}".format)

summ3["Total Revenue"] = summ3["Total Revenue"].map("${0:,.2f}".format)

summ3

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [46]:
cols = ["SN", "Age", "Gender"]

gender = purchase_data.loc[:, cols]
gender.head()

              SN  Age Gender
0        Lisim78   20   Male
1    Lisovynya38   40   Male
2     Ithergue48   24   Male
3  Chamassasya86   24   Male
4      Iskosia90   23   Male

In [47]:
gender = gender.drop_duplicates().reset_index(drop=True)
gender.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 576 entries, 0 to 575
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SN      576 non-null    object
 1   Age     576 non-null    int64
 2   Gender  576 non-null    object
dtypes: int64(1), object(2)
memory usage: 13.6+ KB

In [48]:
gender.groupby("Gender").size()

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
dtype: int64

In [49]:
gender_count = gender.Gender.value_counts()

In [50]:
gender_perc = gender.Gender.value_counts() / len(gender)

In [51]:
gender_count = gender.Gender.value_counts()
gender_perc = gender.Gender.value_counts() / len(gender)

summ_table3 = pd.concat([gender_count, gender_perc], axis=1)
summ_table3.columns = ["Total Count", "Percentage of Players"]

#https://stackoverflow.com/questions/23981601/format-certain-floating-dataframe-columns-into-percentage-in-pandas/43058781
summ_table3.style.format({"Percentage of Players": "{:.2%}"})


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [52]:
gender_count = gender.Gender.value_counts()

gend_purchase_ct = purchase_data.groupby("Gender")["Purchase ID"].count()
avg_gend_price = purchase_data.groupby("Gender")["Price"].mean()
tot_gend_value = gend_purchase_ct * avg_gend_price
avg_total_ind = tot_gend_value / gender_count


summ_table4 = pd.concat([gend_purchase_ct, avg_gend_price, tot_gend_value,
                        avg_total_ind], axis=1)
summ_table4.columns = ["Purchase Count", "Average Purchase Price", 
                       "Total Purchase Value", "Avg Total Purchase per Person"]

#https://stackoverflow.com/questions/36626017/format-a-number-with-comma-separators-and-round-to-2-decimal-places-in-python-2
summ_gend = summ_table4.style.format({"Average Purchase Price": "${:.2f}", "Total Purchase Value": "${0:,.2f}", "Avg Total Purchase per Person": "${:.2f}"})
summ_gend

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [53]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 999]

age_groups = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

pd.cut(purchase_data["Age"], bins, labels=age_groups).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [54]:
gender["Age Group"] = pd.cut(gender["Age"], bins, labels=age_groups)
gender.head()

              SN  Age Gender Age Group
0        Lisim78   20   Male     20-24
1    Lisovynya38   40   Male       40+
2     Ithergue48   24   Male     20-24
3  Chamassasya86   24   Male     20-24
4      Iskosia90   23   Male     20-24

In [55]:
purchase_group = gender.groupby("Age Group")

age_total = purchase_group["Age Group"].count()
age_perc = age_total / total_players

summ_table_age = pd.concat([age_total, age_perc], axis=1)
summ_table_age.columns = ["Total Count", "Percentage of Players"]
summ_table_age2 = summ_table_age.style.format({"Percentage of Players":"{:.2%}"})
summ_table_age2

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [56]:
purchase_data["Age Group"] = pd.cut(purchase_data["Age"], bins, labels=age_groups)
columns = ["SN", "Age", "Price", "Age Group"]
purchase_data_cut = purchase_data.loc[:, columns]

purchase_data_cut

                SN  Age  Price Age Group
0          Lisim78   20   3.53     20-24
1      Lisovynya38   40   1.56       40+
2       Ithergue48   24   4.88     20-24
3    Chamassasya86   24   3.27     20-24
4        Iskosia90   23   1.44     20-24
..             ...  ...    ...       ...
775     Aethedru70   21   3.54     20-24
776         Iral74   21   1.63     20-24
777     Yathecal72   20   3.46     20-24
778        Sisur91    7   4.19       <10
779      Ennrian78   24   4.60     20-24

[780 rows x 4 columns]

In [63]:
ind_purchase = purchase_data_cut.groupby("Age Group")["SN"].nunique()

age_purchase = purchase_data_cut.groupby("Age Group")["Age"].count()
avg_purchase_age = purchase_data_cut.groupby("Age Group")["Price"].mean()
tot_purchase_age = purchase_data_cut.groupby("Age Group")["Price"].sum()
avg_tot_age = tot_purchase_age / ind_purchase

summ_table_demo = pd.concat([age_purchase, avg_purchase_age, tot_purchase_age,
                            avg_tot_age], axis=1)
summ_table_demo.columns = ["Purchase Count", "Average Purchase Price", "Total Purchase Value", "Avg Total Purchase per Person"]

summ_bin = summ_table_demo.style.format({"Average Purchase Price":"${:.2f}", "Total Purchase Value": "${0:,.2f}", "Avg Total Purchase per Person": "${:.2f}"})
summ_bin

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [58]:
tot_sum = purchase_data.groupby("SN").Price.sum()
purch_ct = purchase_data.groupby("SN")["Purchase ID"].count()
avg_buy = tot_sum / purch_ct
summ1 = pd.concat([purch_ct, avg_buy, tot_sum], axis=1).reset_index()
summ1.columns = ["SN", "Purchase Count", "Average Purchase Price", "Total Purchase Value"]

summ2 = summ1[["SN", "Purchase Count", "Average Purchase Price", "Total Purchase Value"]]
summ2 = summ1.set_index("SN")
summ_sn = summ2.sort_values(by=['Total Purchase Value'], ascending=False).head()

summ_sn.style.format({"Average Purchase Price": "${:.2f}", "Total Purchase Value":"${:.2f}"})

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [59]:
purchase_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price',
       'Age Group'],
      dtype='object')

In [60]:
summ5 = purchase_data.groupby(["Item ID", "Item Name"]).agg({"Purchase ID": "count", "Price": "mean"})

#https://www.kite.com/python/answers/how-to-multiply-two-pandas-dataframe-columns-in-python
summ5["Total Purchase Value"] = summ5["Purchase ID"] * summ5["Price"]


summ_item = summ5.sort_values(by=['Purchase ID'], ascending=False).head()

summ_item.style.format({"Price":"${:.2f}", "Total Purchase Value":"${:.2f}"})

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [61]:
summ_profit = summ5.sort_values(by=["Total Purchase Value"], ascending=False).head()

summ_profit.style.format({"Price":"${:.2f}", "Total Purchase Value":"${:.2f}"})